In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('aqprod.csv')
df1

             name category  date    value
0     Afghanistan      AFG  1969     60.0
1     Afghanistan      AFG  1970     60.0
2     Afghanistan      AFG  1971     60.0
3     Afghanistan      AFG  1972     60.0
4     Afghanistan      AFG  1973     60.0
...           ...      ...   ...      ...
9705     Zimbabwe      ZWE  2014  10600.0
9706     Zimbabwe      ZWE  2015  10600.0
9707     Zimbabwe      ZWE  2016  10085.0
9708     Zimbabwe      ZWE  2017  10300.0
9709     Zimbabwe      ZWE  2018  10585.0

[9710 rows x 4 columns]

In [3]:
# date column right now is yyyy, change to 01-01-yyyy
df1['date'] = df1['date'].astype(str) + '-01-01'
# convert to date
df1['date'] = pd.to_datetime(df1['date'], format='%Y-%m-%d')
# write back to data.csv
df1.to_csv('data.csv', index=False)

In [4]:
df1.to_csv('data.csv', index=False)